----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 64, 224, 224]           1,792
       BatchNorm2d-2         [-1, 64, 224, 224]             128
              ReLU-3         [-1, 64, 224, 224]               0
               RBC-4         [-1, 64, 224, 224]               0
            Conv2d-5         [-1, 32, 224, 224]          18,464
       BatchNorm2d-6         [-1, 32, 224, 224]              64
              ReLU-7         [-1, 32, 224, 224]               0
               RBC-8         [-1, 32, 224, 224]               0
         MaxPool2d-9         [-1, 32, 112, 112]               0
           Conv2d-10         [-1, 32, 112, 112]           9,248
      BatchNorm2d-11         [-1, 32, 112, 112]              64
             ReLU-12         [-1, 32, 112, 112]               0
              RBC-13         [-1, 32, 112, 112]               0
        MaxPool2d-14           [-1, 32, 56, 56]               0
           Conv2d-15           [-1, 32, 56, 56]           9,248
      BatchNorm2d-16           [-1, 32, 56, 56]              64
             ReLU-17           [-1, 32, 56, 56]               0
              RBC-18           [-1, 32, 56, 56]               0
        MaxPool2d-19           [-1, 32, 28, 28]               0
           Conv2d-20           [-1, 32, 28, 28]           9,248
      BatchNorm2d-21           [-1, 32, 28, 28]              64
             ReLU-22           [-1, 32, 28, 28]               0
              RBC-23           [-1, 32, 28, 28]               0
        MaxPool2d-24           [-1, 32, 14, 14]               0
           Conv2d-25           [-1, 32, 14, 14]           9,248
      BatchNorm2d-26           [-1, 32, 14, 14]              64
             ReLU-27           [-1, 32, 14, 14]               0
              RBC-28           [-1, 32, 14, 14]               0
        MaxPool2d-29             [-1, 32, 7, 7]               0
           Conv2d-30             [-1, 32, 7, 7]           9,248
      BatchNorm2d-31             [-1, 32, 7, 7]              64
             ReLU-32             [-1, 32, 7, 7]               0
              RBC-33             [-1, 32, 7, 7]               0
           Conv2d-34             [-1, 32, 7, 7]           9,248
      BatchNorm2d-35             [-1, 32, 7, 7]              64
             ReLU-36             [-1, 32, 7, 7]               0
              RBC-37             [-1, 32, 7, 7]               0
           Conv2d-38             [-1, 32, 7, 7]          18,464
      BatchNorm2d-39             [-1, 32, 7, 7]              64
             ReLU-40             [-1, 32, 7, 7]               0
              RBC-41             [-1, 32, 7, 7]               0
           Conv2d-42           [-1, 32, 14, 14]          18,464
      BatchNorm2d-43           [-1, 32, 14, 14]              64
             ReLU-44           [-1, 32, 14, 14]               0
              RBC-45           [-1, 32, 14, 14]               0
           Conv2d-46           [-1, 32, 28, 28]          18,464
      BatchNorm2d-47           [-1, 32, 28, 28]              64
             ReLU-48           [-1, 32, 28, 28]               0
              RBC-49           [-1, 32, 28, 28]               0
           Conv2d-50           [-1, 32, 56, 56]          18,464
      BatchNorm2d-51           [-1, 32, 56, 56]              64
             ReLU-52           [-1, 32, 56, 56]               0
              RBC-53           [-1, 32, 56, 56]               0
           Conv2d-54         [-1, 32, 112, 112]          18,464
      BatchNorm2d-55         [-1, 32, 112, 112]              64
             ReLU-56         [-1, 32, 112, 112]               0
              RBC-57         [-1, 32, 112, 112]               0
           Conv2d-58         [-1, 64, 224, 224]          36,928
      BatchNorm2d-59         [-1, 64, 224, 224]             128
             ReLU-60         [-1, 64, 224, 224]               0
              RBC-61         [-1, 64, 224, 224]               0
              RSU-62         [-1, 64, 224, 224]               0
        MaxPool2d-63         [-1, 64, 112, 112]               0
           Conv2d-64        [-1, 128, 112, 112]          73,856
      BatchNorm2d-65        [-1, 128, 112, 112]             256
             ReLU-66        [-1, 128, 112, 112]               0
              RBC-67        [-1, 128, 112, 112]               0
           Conv2d-68         [-1, 32, 112, 112]          36,896
      BatchNorm2d-69         [-1, 32, 112, 112]              64
             ReLU-70         [-1, 32, 112, 112]               0
              RBC-71         [-1, 32, 112, 112]               0
        MaxPool2d-72           [-1, 32, 56, 56]               0
           Conv2d-73           [-1, 32, 56, 56]           9,248
      BatchNorm2d-74           [-1, 32, 56, 56]              64
             ReLU-75           [-1, 32, 56, 56]               0
              RBC-76           [-1, 32, 56, 56]               0
        MaxPool2d-77           [-1, 32, 28, 28]               0
           Conv2d-78           [-1, 32, 28, 28]           9,248
      BatchNorm2d-79           [-1, 32, 28, 28]              64
             ReLU-80           [-1, 32, 28, 28]               0
              RBC-81           [-1, 32, 28, 28]               0
        MaxPool2d-82           [-1, 32, 14, 14]               0
           Conv2d-83           [-1, 32, 14, 14]           9,248
      BatchNorm2d-84           [-1, 32, 14, 14]              64
             ReLU-85           [-1, 32, 14, 14]               0
              RBC-86           [-1, 32, 14, 14]               0
        MaxPool2d-87             [-1, 32, 7, 7]               0
           Conv2d-88             [-1, 32, 7, 7]           9,248
      BatchNorm2d-89             [-1, 32, 7, 7]              64
             ReLU-90             [-1, 32, 7, 7]               0
              RBC-91             [-1, 32, 7, 7]               0
           Conv2d-92             [-1, 32, 7, 7]           9,248
      BatchNorm2d-93             [-1, 32, 7, 7]              64
             ReLU-94             [-1, 32, 7, 7]               0
              RBC-95             [-1, 32, 7, 7]               0
           Conv2d-96             [-1, 32, 7, 7]          18,464
      BatchNorm2d-97             [-1, 32, 7, 7]              64
             ReLU-98             [-1, 32, 7, 7]               0
              RBC-99             [-1, 32, 7, 7]               0
          Conv2d-100           [-1, 32, 14, 14]          18,464
     BatchNorm2d-101           [-1, 32, 14, 14]              64
            ReLU-102           [-1, 32, 14, 14]               0
             RBC-103           [-1, 32, 14, 14]               0
          Conv2d-104           [-1, 32, 28, 28]          18,464
     BatchNorm2d-105           [-1, 32, 28, 28]              64
            ReLU-106           [-1, 32, 28, 28]               0
             RBC-107           [-1, 32, 28, 28]               0
          Conv2d-108           [-1, 32, 56, 56]          18,464
     BatchNorm2d-109           [-1, 32, 56, 56]              64
            ReLU-110           [-1, 32, 56, 56]               0
             RBC-111           [-1, 32, 56, 56]               0
          Conv2d-112        [-1, 128, 112, 112]          73,856
     BatchNorm2d-113        [-1, 128, 112, 112]             256
            ReLU-114        [-1, 128, 112, 112]               0
             RBC-115        [-1, 128, 112, 112]               0
             RSU-116        [-1, 128, 112, 112]               0
       MaxPool2d-117          [-1, 128, 56, 56]               0
          Conv2d-118          [-1, 256, 56, 56]         295,168
     BatchNorm2d-119          [-1, 256, 56, 56]             512
            ReLU-120          [-1, 256, 56, 56]               0
             RBC-121          [-1, 256, 56, 56]               0
          Conv2d-122           [-1, 64, 56, 56]         147,520
     BatchNorm2d-123           [-1, 64, 56, 56]             128
            ReLU-124           [-1, 64, 56, 56]               0
             RBC-125           [-1, 64, 56, 56]               0
       MaxPool2d-126           [-1, 64, 28, 28]               0
          Conv2d-127           [-1, 64, 28, 28]          36,928
     BatchNorm2d-128           [-1, 64, 28, 28]             128
            ReLU-129           [-1, 64, 28, 28]               0
             RBC-130           [-1, 64, 28, 28]               0
       MaxPool2d-131           [-1, 64, 14, 14]               0
          Conv2d-132           [-1, 64, 14, 14]          36,928
     BatchNorm2d-133           [-1, 64, 14, 14]             128
            ReLU-134           [-1, 64, 14, 14]               0
             RBC-135           [-1, 64, 14, 14]               0
       MaxPool2d-136             [-1, 64, 7, 7]               0
          Conv2d-137             [-1, 64, 7, 7]          36,928
     BatchNorm2d-138             [-1, 64, 7, 7]             128
            ReLU-139             [-1, 64, 7, 7]               0
             RBC-140             [-1, 64, 7, 7]               0
          Conv2d-141             [-1, 64, 7, 7]          36,928
     BatchNorm2d-142             [-1, 64, 7, 7]             128
            ReLU-143             [-1, 64, 7, 7]               0
             RBC-144             [-1, 64, 7, 7]               0
          Conv2d-145             [-1, 64, 7, 7]          73,792
     BatchNorm2d-146             [-1, 64, 7, 7]             128
            ReLU-147             [-1, 64, 7, 7]               0
             RBC-148             [-1, 64, 7, 7]               0
          Conv2d-149           [-1, 64, 14, 14]          73,792
     BatchNorm2d-150           [-1, 64, 14, 14]             128
            ReLU-151           [-1, 64, 14, 14]               0
             RBC-152           [-1, 64, 14, 14]               0
          Conv2d-153           [-1, 64, 28, 28]          73,792
     BatchNorm2d-154           [-1, 64, 28, 28]             128
            ReLU-155           [-1, 64, 28, 28]               0
             RBC-156           [-1, 64, 28, 28]               0
          Conv2d-157          [-1, 256, 56, 56]         295,168
     BatchNorm2d-158          [-1, 256, 56, 56]             512
            ReLU-159          [-1, 256, 56, 56]               0
             RBC-160          [-1, 256, 56, 56]               0
             RSU-161          [-1, 256, 56, 56]               0
       MaxPool2d-162          [-1, 256, 28, 28]               0
          Conv2d-163          [-1, 512, 28, 28]       1,180,160
     BatchNorm2d-164          [-1, 512, 28, 28]           1,024
            ReLU-165          [-1, 512, 28, 28]               0
             RBC-166          [-1, 512, 28, 28]               0
          Conv2d-167          [-1, 128, 28, 28]         589,952
     BatchNorm2d-168          [-1, 128, 28, 28]             256
            ReLU-169          [-1, 128, 28, 28]               0
             RBC-170          [-1, 128, 28, 28]               0
       MaxPool2d-171          [-1, 128, 14, 14]               0
          Conv2d-172          [-1, 128, 14, 14]         147,584
     BatchNorm2d-173          [-1, 128, 14, 14]             256
            ReLU-174          [-1, 128, 14, 14]               0
             RBC-175          [-1, 128, 14, 14]               0
       MaxPool2d-176            [-1, 128, 7, 7]               0
          Conv2d-177            [-1, 128, 7, 7]         147,584
     BatchNorm2d-178            [-1, 128, 7, 7]             256
            ReLU-179            [-1, 128, 7, 7]               0
             RBC-180            [-1, 128, 7, 7]               0
          Conv2d-181            [-1, 128, 7, 7]         147,584
     BatchNorm2d-182            [-1, 128, 7, 7]             256
            ReLU-183            [-1, 128, 7, 7]               0
             RBC-184            [-1, 128, 7, 7]               0
          Conv2d-185            [-1, 128, 7, 7]         295,040
     BatchNorm2d-186            [-1, 128, 7, 7]             256
            ReLU-187            [-1, 128, 7, 7]               0
             RBC-188            [-1, 128, 7, 7]               0
          Conv2d-189          [-1, 128, 14, 14]         295,040
     BatchNorm2d-190          [-1, 128, 14, 14]             256
            ReLU-191          [-1, 128, 14, 14]               0
             RBC-192          [-1, 128, 14, 14]               0
          Conv2d-193          [-1, 512, 28, 28]       1,180,160
     BatchNorm2d-194          [-1, 512, 28, 28]           1,024
            ReLU-195          [-1, 512, 28, 28]               0
             RBC-196          [-1, 512, 28, 28]               0
             RSU-197          [-1, 512, 28, 28]               0
       MaxPool2d-198          [-1, 512, 14, 14]               0
          Conv2d-199          [-1, 512, 14, 14]       2,359,808
     BatchNorm2d-200          [-1, 512, 14, 14]           1,024
            ReLU-201          [-1, 512, 14, 14]               0
             RBC-202          [-1, 512, 14, 14]               0
          Conv2d-203          [-1, 256, 14, 14]       1,179,904
     BatchNorm2d-204          [-1, 256, 14, 14]             512
            ReLU-205          [-1, 256, 14, 14]               0
             RBC-206          [-1, 256, 14, 14]               0
          Conv2d-207          [-1, 256, 14, 14]         590,080
     BatchNorm2d-208          [-1, 256, 14, 14]             512
            ReLU-209          [-1, 256, 14, 14]               0
             RBC-210          [-1, 256, 14, 14]               0
          Conv2d-211          [-1, 256, 14, 14]         590,080
     BatchNorm2d-212          [-1, 256, 14, 14]             512
            ReLU-213          [-1, 256, 14, 14]               0
             RBC-214          [-1, 256, 14, 14]               0
          Conv2d-215          [-1, 256, 14, 14]         590,080
     BatchNorm2d-216          [-1, 256, 14, 14]             512
            ReLU-217          [-1, 256, 14, 14]               0
             RBC-218          [-1, 256, 14, 14]               0
          Conv2d-219          [-1, 256, 14, 14]       1,179,904
     BatchNorm2d-220          [-1, 256, 14, 14]             512
            ReLU-221          [-1, 256, 14, 14]               0
             RBC-222          [-1, 256, 14, 14]               0
          Conv2d-223          [-1, 256, 14, 14]       1,179,904
     BatchNorm2d-224          [-1, 256, 14, 14]             512
            ReLU-225          [-1, 256, 14, 14]               0
             RBC-226          [-1, 256, 14, 14]               0
          Conv2d-227          [-1, 512, 14, 14]       2,359,808
     BatchNorm2d-228          [-1, 512, 14, 14]           1,024
            ReLU-229          [-1, 512, 14, 14]               0
             RBC-230          [-1, 512, 14, 14]               0
             RSU-231          [-1, 512, 14, 14]               0
       MaxPool2d-232            [-1, 512, 7, 7]               0
          Conv2d-233            [-1, 512, 7, 7]       2,359,808
     BatchNorm2d-234            [-1, 512, 7, 7]           1,024
            ReLU-235            [-1, 512, 7, 7]               0
             RBC-236            [-1, 512, 7, 7]               0
          Conv2d-237            [-1, 256, 7, 7]       1,179,904
     BatchNorm2d-238            [-1, 256, 7, 7]             512
            ReLU-239            [-1, 256, 7, 7]               0
             RBC-240            [-1, 256, 7, 7]               0
          Conv2d-241            [-1, 256, 7, 7]         590,080
     BatchNorm2d-242            [-1, 256, 7, 7]             512
            ReLU-243            [-1, 256, 7, 7]               0
             RBC-244            [-1, 256, 7, 7]               0
          Conv2d-245            [-1, 256, 7, 7]         590,080
     BatchNorm2d-246            [-1, 256, 7, 7]             512
            ReLU-247            [-1, 256, 7, 7]               0
             RBC-248            [-1, 256, 7, 7]               0
          Conv2d-249            [-1, 256, 7, 7]         590,080
     BatchNorm2d-250            [-1, 256, 7, 7]             512
            ReLU-251            [-1, 256, 7, 7]               0
             RBC-252            [-1, 256, 7, 7]               0
          Conv2d-253            [-1, 256, 7, 7]       1,179,904
     BatchNorm2d-254            [-1, 256, 7, 7]             512
            ReLU-255            [-1, 256, 7, 7]               0
             RBC-256            [-1, 256, 7, 7]               0
          Conv2d-257            [-1, 256, 7, 7]       1,179,904
     BatchNorm2d-258            [-1, 256, 7, 7]             512
            ReLU-259            [-1, 256, 7, 7]               0
             RBC-260            [-1, 256, 7, 7]               0
          Conv2d-261            [-1, 512, 7, 7]       2,359,808
     BatchNorm2d-262            [-1, 512, 7, 7]           1,024
            ReLU-263            [-1, 512, 7, 7]               0
             RBC-264            [-1, 512, 7, 7]               0
             RSU-265            [-1, 512, 7, 7]               0
          Conv2d-266              [-1, 1, 7, 7]           4,609
          Conv2d-267          [-1, 512, 14, 14]       4,719,104
     BatchNorm2d-268          [-1, 512, 14, 14]           1,024
            ReLU-269          [-1, 512, 14, 14]               0
             RBC-270          [-1, 512, 14, 14]               0
          Conv2d-271          [-1, 256, 14, 14]       1,179,904
     BatchNorm2d-272          [-1, 256, 14, 14]             512
            ReLU-273          [-1, 256, 14, 14]               0
             RBC-274          [-1, 256, 14, 14]               0
          Conv2d-275          [-1, 256, 14, 14]         590,080
     BatchNorm2d-276          [-1, 256, 14, 14]             512
            ReLU-277          [-1, 256, 14, 14]               0
             RBC-278          [-1, 256, 14, 14]               0
          Conv2d-279          [-1, 256, 14, 14]         590,080
     BatchNorm2d-280          [-1, 256, 14, 14]             512
            ReLU-281          [-1, 256, 14, 14]               0
             RBC-282          [-1, 256, 14, 14]               0
          Conv2d-283          [-1, 256, 14, 14]         590,080
     BatchNorm2d-284          [-1, 256, 14, 14]             512
            ReLU-285          [-1, 256, 14, 14]               0
             RBC-286          [-1, 256, 14, 14]               0
          Conv2d-287          [-1, 256, 14, 14]       1,179,904
     BatchNorm2d-288          [-1, 256, 14, 14]             512
            ReLU-289          [-1, 256, 14, 14]               0
             RBC-290          [-1, 256, 14, 14]               0
          Conv2d-291          [-1, 256, 14, 14]       1,179,904
     BatchNorm2d-292          [-1, 256, 14, 14]             512
            ReLU-293          [-1, 256, 14, 14]               0
             RBC-294          [-1, 256, 14, 14]               0
          Conv2d-295          [-1, 512, 14, 14]       2,359,808
     BatchNorm2d-296          [-1, 512, 14, 14]           1,024
            ReLU-297          [-1, 512, 14, 14]               0
             RBC-298          [-1, 512, 14, 14]               0
             RSU-299          [-1, 512, 14, 14]               0
          Conv2d-300            [-1, 1, 14, 14]           4,609
          Conv2d-301          [-1, 256, 28, 28]       2,359,552
     BatchNorm2d-302          [-1, 256, 28, 28]             512
            ReLU-303          [-1, 256, 28, 28]               0
             RBC-304          [-1, 256, 28, 28]               0
          Conv2d-305          [-1, 128, 28, 28]         295,040
     BatchNorm2d-306          [-1, 128, 28, 28]             256
            ReLU-307          [-1, 128, 28, 28]               0
             RBC-308          [-1, 128, 28, 28]               0
       MaxPool2d-309          [-1, 128, 14, 14]               0
          Conv2d-310          [-1, 128, 14, 14]         147,584
     BatchNorm2d-311          [-1, 128, 14, 14]             256
            ReLU-312          [-1, 128, 14, 14]               0
             RBC-313          [-1, 128, 14, 14]               0
       MaxPool2d-314            [-1, 128, 7, 7]               0
          Conv2d-315            [-1, 128, 7, 7]         147,584
     BatchNorm2d-316            [-1, 128, 7, 7]             256
            ReLU-317            [-1, 128, 7, 7]               0
             RBC-318            [-1, 128, 7, 7]               0
          Conv2d-319            [-1, 128, 7, 7]         147,584
     BatchNorm2d-320            [-1, 128, 7, 7]             256
            ReLU-321            [-1, 128, 7, 7]               0
             RBC-322            [-1, 128, 7, 7]               0
          Conv2d-323            [-1, 128, 7, 7]         295,040
     BatchNorm2d-324            [-1, 128, 7, 7]             256
            ReLU-325            [-1, 128, 7, 7]               0
             RBC-326            [-1, 128, 7, 7]               0
          Conv2d-327          [-1, 128, 14, 14]         295,040
     BatchNorm2d-328          [-1, 128, 14, 14]             256
            ReLU-329          [-1, 128, 14, 14]               0
             RBC-330          [-1, 128, 14, 14]               0
          Conv2d-331          [-1, 256, 28, 28]         590,080
     BatchNorm2d-332          [-1, 256, 28, 28]             512
            ReLU-333          [-1, 256, 28, 28]               0
             RBC-334          [-1, 256, 28, 28]               0
             RSU-335          [-1, 256, 28, 28]               0
          Conv2d-336            [-1, 1, 28, 28]           2,305
          Conv2d-337          [-1, 128, 56, 56]         589,952
     BatchNorm2d-338          [-1, 128, 56, 56]             256
            ReLU-339          [-1, 128, 56, 56]               0
             RBC-340          [-1, 128, 56, 56]               0
          Conv2d-341           [-1, 64, 56, 56]          73,792
     BatchNorm2d-342           [-1, 64, 56, 56]             128
            ReLU-343           [-1, 64, 56, 56]               0
             RBC-344           [-1, 64, 56, 56]               0
       MaxPool2d-345           [-1, 64, 28, 28]               0
          Conv2d-346           [-1, 64, 28, 28]          36,928
     BatchNorm2d-347           [-1, 64, 28, 28]             128
            ReLU-348           [-1, 64, 28, 28]               0
             RBC-349           [-1, 64, 28, 28]               0
       MaxPool2d-350           [-1, 64, 14, 14]               0
          Conv2d-351           [-1, 64, 14, 14]          36,928
     BatchNorm2d-352           [-1, 64, 14, 14]             128
            ReLU-353           [-1, 64, 14, 14]               0
             RBC-354           [-1, 64, 14, 14]               0
       MaxPool2d-355             [-1, 64, 7, 7]               0
          Conv2d-356             [-1, 64, 7, 7]          36,928
     BatchNorm2d-357             [-1, 64, 7, 7]             128
            ReLU-358             [-1, 64, 7, 7]               0
             RBC-359             [-1, 64, 7, 7]               0
          Conv2d-360             [-1, 64, 7, 7]          36,928
     BatchNorm2d-361             [-1, 64, 7, 7]             128
            ReLU-362             [-1, 64, 7, 7]               0
             RBC-363             [-1, 64, 7, 7]               0
          Conv2d-364             [-1, 64, 7, 7]          73,792
     BatchNorm2d-365             [-1, 64, 7, 7]             128
            ReLU-366             [-1, 64, 7, 7]               0
             RBC-367             [-1, 64, 7, 7]               0
          Conv2d-368           [-1, 64, 14, 14]          73,792
     BatchNorm2d-369           [-1, 64, 14, 14]             128
            ReLU-370           [-1, 64, 14, 14]               0
             RBC-371           [-1, 64, 14, 14]               0
          Conv2d-372           [-1, 64, 28, 28]          73,792
     BatchNorm2d-373           [-1, 64, 28, 28]             128
            ReLU-374           [-1, 64, 28, 28]               0
             RBC-375           [-1, 64, 28, 28]               0
          Conv2d-376          [-1, 128, 56, 56]         147,584
     BatchNorm2d-377          [-1, 128, 56, 56]             256
            ReLU-378          [-1, 128, 56, 56]               0
             RBC-379          [-1, 128, 56, 56]               0
             RSU-380          [-1, 128, 56, 56]               0
          Conv2d-381            [-1, 1, 56, 56]           1,153
          Conv2d-382         [-1, 64, 112, 112]         147,520
     BatchNorm2d-383         [-1, 64, 112, 112]             128
            ReLU-384         [-1, 64, 112, 112]               0
             RBC-385         [-1, 64, 112, 112]               0
          Conv2d-386         [-1, 32, 112, 112]          18,464
     BatchNorm2d-387         [-1, 32, 112, 112]              64
            ReLU-388         [-1, 32, 112, 112]               0
             RBC-389         [-1, 32, 112, 112]               0
       MaxPool2d-390           [-1, 32, 56, 56]               0
          Conv2d-391           [-1, 32, 56, 56]           9,248
     BatchNorm2d-392           [-1, 32, 56, 56]              64
            ReLU-393           [-1, 32, 56, 56]               0
             RBC-394           [-1, 32, 56, 56]               0
       MaxPool2d-395           [-1, 32, 28, 28]               0
          Conv2d-396           [-1, 32, 28, 28]           9,248
     BatchNorm2d-397           [-1, 32, 28, 28]              64
            ReLU-398           [-1, 32, 28, 28]               0
             RBC-399           [-1, 32, 28, 28]               0
       MaxPool2d-400           [-1, 32, 14, 14]               0
          Conv2d-401           [-1, 32, 14, 14]           9,248
     BatchNorm2d-402           [-1, 32, 14, 14]              64
            ReLU-403           [-1, 32, 14, 14]               0
             RBC-404           [-1, 32, 14, 14]               0
       MaxPool2d-405             [-1, 32, 7, 7]               0
          Conv2d-406             [-1, 32, 7, 7]           9,248
     BatchNorm2d-407             [-1, 32, 7, 7]              64
            ReLU-408             [-1, 32, 7, 7]               0
             RBC-409             [-1, 32, 7, 7]               0
          Conv2d-410             [-1, 32, 7, 7]           9,248
     BatchNorm2d-411             [-1, 32, 7, 7]              64
            ReLU-412             [-1, 32, 7, 7]               0
             RBC-413             [-1, 32, 7, 7]               0
          Conv2d-414             [-1, 32, 7, 7]          18,464
     BatchNorm2d-415             [-1, 32, 7, 7]              64
            ReLU-416             [-1, 32, 7, 7]               0
             RBC-417             [-1, 32, 7, 7]               0
          Conv2d-418           [-1, 32, 14, 14]          18,464
     BatchNorm2d-419           [-1, 32, 14, 14]              64
            ReLU-420           [-1, 32, 14, 14]               0
             RBC-421           [-1, 32, 14, 14]               0
          Conv2d-422           [-1, 32, 28, 28]          18,464
     BatchNorm2d-423           [-1, 32, 28, 28]              64
            ReLU-424           [-1, 32, 28, 28]               0
             RBC-425           [-1, 32, 28, 28]               0
          Conv2d-426           [-1, 32, 56, 56]          18,464
     BatchNorm2d-427           [-1, 32, 56, 56]              64
            ReLU-428           [-1, 32, 56, 56]               0
             RBC-429           [-1, 32, 56, 56]               0
          Conv2d-430         [-1, 64, 112, 112]          36,928
     BatchNorm2d-431         [-1, 64, 112, 112]             128
            ReLU-432         [-1, 64, 112, 112]               0
             RBC-433         [-1, 64, 112, 112]               0
             RSU-434         [-1, 64, 112, 112]               0
          Conv2d-435          [-1, 1, 112, 112]             577
          Conv2d-436         [-1, 64, 224, 224]          73,792
     BatchNorm2d-437         [-1, 64, 224, 224]             128
            ReLU-438         [-1, 64, 224, 224]               0
             RBC-439         [-1, 64, 224, 224]               0
          Conv2d-440         [-1, 16, 224, 224]           9,232
     BatchNorm2d-441         [-1, 16, 224, 224]              32
            ReLU-442         [-1, 16, 224, 224]               0
             RBC-443         [-1, 16, 224, 224]               0
       MaxPool2d-444         [-1, 16, 112, 112]               0
          Conv2d-445         [-1, 16, 112, 112]           2,320
     BatchNorm2d-446         [-1, 16, 112, 112]              32
            ReLU-447         [-1, 16, 112, 112]               0
             RBC-448         [-1, 16, 112, 112]               0
       MaxPool2d-449           [-1, 16, 56, 56]               0
          Conv2d-450           [-1, 16, 56, 56]           2,320
     BatchNorm2d-451           [-1, 16, 56, 56]              32
            ReLU-452           [-1, 16, 56, 56]               0
             RBC-453           [-1, 16, 56, 56]               0
       MaxPool2d-454           [-1, 16, 28, 28]               0
          Conv2d-455           [-1, 16, 28, 28]           2,320
     BatchNorm2d-456           [-1, 16, 28, 28]              32
            ReLU-457           [-1, 16, 28, 28]               0
             RBC-458           [-1, 16, 28, 28]               0
       MaxPool2d-459           [-1, 16, 14, 14]               0
          Conv2d-460           [-1, 16, 14, 14]           2,320
     BatchNorm2d-461           [-1, 16, 14, 14]              32
            ReLU-462           [-1, 16, 14, 14]               0
             RBC-463           [-1, 16, 14, 14]               0
       MaxPool2d-464             [-1, 16, 7, 7]               0
          Conv2d-465             [-1, 16, 7, 7]           2,320
     BatchNorm2d-466             [-1, 16, 7, 7]              32
            ReLU-467             [-1, 16, 7, 7]               0
             RBC-468             [-1, 16, 7, 7]               0
          Conv2d-469             [-1, 16, 7, 7]           2,320
     BatchNorm2d-470             [-1, 16, 7, 7]              32
            ReLU-471             [-1, 16, 7, 7]               0
             RBC-472             [-1, 16, 7, 7]               0
          Conv2d-473             [-1, 16, 7, 7]           4,624
     BatchNorm2d-474             [-1, 16, 7, 7]              32
            ReLU-475             [-1, 16, 7, 7]               0
             RBC-476             [-1, 16, 7, 7]               0
          Conv2d-477           [-1, 16, 14, 14]           4,624
     BatchNorm2d-478           [-1, 16, 14, 14]              32
            ReLU-479           [-1, 16, 14, 14]               0
             RBC-480           [-1, 16, 14, 14]               0
          Conv2d-481           [-1, 16, 28, 28]           4,624
     BatchNorm2d-482           [-1, 16, 28, 28]              32
            ReLU-483           [-1, 16, 28, 28]               0
             RBC-484           [-1, 16, 28, 28]               0
          Conv2d-485           [-1, 16, 56, 56]           4,624
     BatchNorm2d-486           [-1, 16, 56, 56]              32
            ReLU-487           [-1, 16, 56, 56]               0
             RBC-488           [-1, 16, 56, 56]               0
          Conv2d-489         [-1, 16, 112, 112]           4,624
     BatchNorm2d-490         [-1, 16, 112, 112]              32
            ReLU-491         [-1, 16, 112, 112]               0
             RBC-492         [-1, 16, 112, 112]               0
          Conv2d-493         [-1, 64, 224, 224]          18,496
     BatchNorm2d-494         [-1, 64, 224, 224]             128
            ReLU-495         [-1, 64, 224, 224]               0
             RBC-496         [-1, 64, 224, 224]               0
             RSU-497         [-1, 64, 224, 224]               0
          Conv2d-498          [-1, 1, 224, 224]             577
          Conv2d-499          [-1, 1, 224, 224]               7
================================================================
Total params: 44,009,869
Trainable params: 44,009,869
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.57
Forward/backward pass size (MB): 982.99
Params size (MB): 167.88
Estimated Total Size (MB): 1151.45